app/Models/Article.php

    public function scopeLastLimit($query, $numbers)
    {
        return $query->with('state', 'tags')->orderBy('created_at', 'desc')->limit($numbers)->get();
---
select * from `articles` order by `created_at` desc limit 5

    public function scopeAllPaginate($query, $numbers)
    {
        return $query->with('tags', 'state')->orderBy('created_at', 'desc')->paginate($numbers);
---
select count(*) as aggregate from `articles`